<?php
    return [
        'LABEL_CATID'       => 'Тип',
        'LABEL_BRANDID'     => 'Марка',
        'LABEL_MODEL'       => 'Модель',
        'LABEL_HID'         => 'Доп.фильтр',
        'LABEL_NAME'        => 'Наименование',
        'LABEL_SUBCATID'    => 'Подкатегория',
        'LABEL_GROUP'       => 'Группа',
        
        ////////////////////////////////////////////////////////////////////////
        //              VIEWS
        'TRANSCAT_HEADER'   => 'Категории транспортных средств',
        'ADD_CATEGORY'      => 'Добавить Категорию',
        'ADD_SUBCATEGORY'   => 'Добавить Подкатегорию',
        'SHOW_SUBCATS'      => 'Показать Подкатегории',
        
        'DELETE_CATEGORY'   => 'Удаляем Категорию',
        'DELETE_CATEGORY_DOP'   => 'и все вложенные Подкатегории',
        'DELETE_SUBCATEGORY'    => 'Удаляем Подкатегорию',
        
        'BRAND_MODELS'      => 'Бренды и Модели',
        'ADD_BRAND'         => 'Добавить Бренд',
        'ADD_MODEL'         => 'Добавить Модель',
        'ADD_GROUP'         => 'Добавить Группу',
        
        'DELETE_BRAND'      => 'Удаляем строку ',
        'DELETE_BRAND_DOP'  => 'и все вложенные модели',
        'DELETE_MODEL'      => 'Удаляем модель ',
        'DELETE_GROUP'      => 'Удаляем Группу',
        'DELETE_GROUP_BLOCK' => 'Эта группа назначена одной или нескольким Категориям в таблице справа. \r\n'
            .'Назначьте этим Категориям другую Группу затем повторите попытку',
        
        'DOP_FILTERS'       => 'Доп.Фильтры',
        'ADD_FILTER'        => 'Добавить Фильтр',
        'ADD_FEATURE'       => 'Добавить Значение',     
        'DELETE_FILTER_DOP' => 'и все вложенные значения',
        'DELETE_FEATURE'    => 'Удаляем строку ',
        
        'USER_LIST'         => 'Список пользователей',
        'CHANGE_ACCOUNT'    => 'Изменяем аккаунт пользователя',
        'CHANGE_STATUS'     => 'Изменяем статус пользователя',
        'DELETE_USER'       => 'Удаляем пользователя',
    ];

