<?php
    return [
        'TROST_AUTO'        => 'Продажа автомобильных запчастей, ремонтного  оборудования, инструмента.',
        'VELES_AGRO'        => 'Производство сельхозтехники и запчастей.',
        'BARTHAU'           => 'Производство различных видов прицепов.',
        'SAPHIR'            => 'Производство сельхозтехники и оборудования.',
        'VERMEER'           => 'Производство строительного и уборочного оборудования.',
        'LEMKEN'            => 'Производство сельхозтехники.',


    ];