<?php
    return [
        ////////////////////////////////////////////////////////////////////////
        //          MAINMENU
        'LANG'          => 'на русском',
        'REGISTER'      => 'Регистрация',
        'LOGIN'         => 'Логин',
        'PROFILE'       => 'Профиль',
        'LOGOUT'        => 'Выйти',
        'MAIN'          => 'Главная',
        'CAR'           => 'Легковые',
        'TRUCK'         => 'Грузовые',
        'BUS'           => 'Автобусы',
        'SPEC'          => 'Спецтехника',
        'BIKE'          => 'Мотоциклы',
        'BOAT'          => 'Лодки',
        'SITE_ZONE'     => 'Сайт',
        'ADMIN_ZONE'    => 'Администратор',
        'LIST'          => 'Список',
        'BOOKMARK'      => 'Закладки',
        
        'ADMIN_BUY'     => 'Выкуп',
        'ADMIN_SEARCH'  => 'Поиск',
        'ADMIN_MESS'    => 'Сообщения',
        'ADMIN_SETTING' => 'Настройки',
        'ADMIN_VIDTRANS'=> 'Виды транспорта',
        'ADMIN_MODEL'   => 'Модели',
        'ADMIN_FILTER'  => 'Доп.фильтры',
        'ADMIN_USER'    => 'Пользователи',
        'ADMIN_PAYMENT' => 'Оплаты',
        
        
        
        ////////////////////////////////////////////////////////////////////////
        //          CAROUSEL
        'IMG1_HEADER'   => 'Продажа транспортных средств',
        'IMG1_TEXT'     => '
            <p>Срочный выкуп или прием транспорта на комиссию</p>
            <p>Синхронизация предложений партнеров с других сайтов</p>
            <p>Поиск интересующего транспорта по запросу</p>
        ',
        'IMG2_HEADER'   => '',
        'IMG2_TEXT'     => '
        
        ',
        'IMG3_HEADER'   => '',
        'IMG3_TEXT'     => '
        
        ',    
        
        
        ////////////////////////////////////////////////////////////////////////
        //          BLOCK1
        'BLOCK1_HEADER' => 'Срочный выкуп Транспорта',
        'BLOCK1_TEXT'   => '
            <li>Покупка в любом техническом состоянии</li>
            <li>Быстрая оценка стоимости авто</li>
            <li>Наличный и безналичный расчет</li>
        ',  
        'BLOCK1_BUTTON' => 'Отправить заявку',
        
        
        ////////////////////////////////////////////////////////////////////////
        //          BLOCK2
        'BLOCK2_HEADER' => 'Синхронизация предложений',
        'BLOCK2_TEXT'   => '
            При налиии своих предложений на других сайтах <br />
            не нужно загружать и редактировать информацию на нашем сайте отдельно <br/>
            достатоно воспользоваться услугой синхронизации.
        ',


        ////////////////////////////////////////////////////////////////////////
        //          BLOCK3
        'BLOCK3_HEADER' => 'Наши партнеры',

        
        
        ////////////////////////////////////////////////////////////////////////
        //          FOOTER
        'CONTACTS'          => 'Контакты',
        'AGREEMENTS'        => 'Соглашения',
        'USER_AGREEMENT'    => 'Пользовательское соглашение',

        'FOOTER_HEADER2'    => 'Наши услуги',          
        'FOOTER_TEXT2'      => '
            <p>Наша компания предоставляет клиентам удобный сервис в сфере 
            продажи транспортных средств и запасных частей.</p>
            
            <p>С помощью нашего сайта мы предоставляем возможность нашим 
            партнерам размещать свои предложения.</p>
        ', 
        
        'EMAIL_SUBJECT'     => 'Тема сообщения',
        'EMAIL_NAME'        => 'Ваше имя',
        'EMAIL_FROM'        => 'Ваш Email',
        'EMAIL_BODY'        => 'Сообщение',
        'EMAIL_BUTTON'      => 'Отправить',
        
        
        ////////////////////////////////////////////////////////////////////////
        //          COMMON
        'ALL'               => 'Все',
        'DATE'              => 'Дата',
        'YEAR'              => 'Год',
        'MONTH'             => 'Месяц',
        'PRICE'             => 'Цена',
        'ADD'               => 'Добавить',
        'ADD_MORE'          => 'Добавить еще',
        'ADD_PHOTO'         => 'Добавить фото',
        'EDIT'              => 'Редактировать',
        'EDIT_SHORT'        => 'Редакт.',
        'UPLOAD'            => 'Загрузить',
        'EXCLUDE'           => 'Исключить',
        'INCLUDE'           => 'Включить',
        'DELETE'            => 'Удалить',
        'DELETE_ALL'        => 'Удалить все',
        'UPDATE'            => 'Обновить',
        'UPDATED'           => 'Успешно обновлено',
        'RESET'             => 'Сброс',
        'FILTER'            => 'Фильтр',
        'SHOW_MODELS'       => 'Показать модели',
        'SHOW_FEATURES'     => 'Показать значения',
        'ADVERT'            => 'Реклама',
        'MENU'              => 'Меню',
        'RESUME'            => 'Возобновить',
        'FROM'              => 'от',
        'TO'                => 'до',
        'VERIFY_CODE'       => 'Проверочный код',
        
        'INCORRECT_PARAMS'  => 'Неверные входящие параметры',
        'SEND_EMAIL_ERR'    => 'Произошла ошибка при отправке Email',
        'SAVE_TO_BASE_ERR'  => 'Произошла ошибка при записи в базу',
        'REQUIRED_FIELDS'   => 'поля обязательные для заполнения',
        'SAVE'              => 'Сохранить',
        'SAVED'             => 'Успешно сохранено',
        'TYPE_NAME'         => 'Введите имя',
        'TYPE_EMAIL'        => 'Введите ваш EMail',
        'IMAGE_EXTESIONS'   => 'Допустима загрузка файлов только с расширениями gif, jpg, jpeg, png',
        'GEOCODE_ERR'       => 'Ошибка геокодирования ',
        'UPLOAD_ERR'        => 'Ошибка загрузки файла',
        'DELETE_ERR'        => 'Ошибка при удалении файла',
        'CONFIRM_DELETION'  => 'Удаляем файл',
        'NO_RECORDS_FOUND'  => 'Не найдено ни одной записи',
        
        'NAME_EXISTS'       => 'Такое наименование уже существует',
        'CURL_INIT_ERR'     => 'Невозможно создать новый сеанс cURL',
        'PROCESSING'        => 'Выполняется обработка данных',
        'CONFIRM_PAGE_LEAVING'  => 'Вы уверены что хотите уйти с этой страницы',

        'REMEMBER'          => 'Запомнить',
        'SEND'              => 'Отправить',

        
        ////////////////////////////////////////////////////////////////////////
        //          PROPOSAL  VIEW
        'AUTOMOBILES'       => 'Автомобили',
        'SPARES'            => 'Запчасти',
        'DEMAND'            => 'Спрос',
        'ON_MAP'            => 'На карте',
        'FIND'              => 'Найти',
        'ALL_BRANDS'        => 'Все марки',
        'BRANDS'            => 'Марки',
        'MODELS'            => 'Модели',

        'WHOLE_EUROPE'      => 'Вся Европа',
        'NDS_ONLY'          => 'Только &nbsp; с &nbsp; НДС',
        'TOTAL'             => 'Всего',
        'EDIT_DATA'         => 'Редактировать данные',

        ////////////////////////////////////////////////////////////////////////
        //          DETAILS  VIEW
        'ADD_TOBOOKMARK'    => 'Добавить в закладки',
        'SHARE'             => 'Поделиться',
        'BOOKMARK_CREATED'  => 'Закладка успешно создана',
        'BACK_TO_LIST'      => 'Вернуться к списку предложений',
        'DELETE_BOOKMARK'   => 'Удалить закладку',

        'WRITE_MESSAGE'     => 'Написать сообщение',
        'CONNECTION_TYPE'   => 'Способ связи',
        'PHONE'             => 'Телефон',
        'YOUR_EMAIL'        => 'Ваш email',
        'YOUR_MESSAGE'      => 'Ваше сообщение',
        'TYPE_CODE'         => 'Введите Код',
        'SEND_MESSAGE'      => 'Отправить сообщение',
        'CLICK_TO_REFRESH'  => 'Щелкните чтобы обновить',
        'MESSAGE_SENT'      => 'Ваше сообщение успешно отправлено',

        'MESSAGE_SUBJECT'   => 'Вам поступило сообщение с сайта ' .Yii::$app->request->hostInfo,
        'MESSAGE_FIRST_LINE' => 'По вашему предложению от ',
        'MESSAGE'           => 'Сообщение',
        'CONNECTION'        => 'Связь',


        ////////////////////////////////////////////////////////////////////////
        //          OTHER
        'MONTH1'            => 'Янв',
        'MONTH2'            => 'Фев',
        'MONTH3'            => 'Март',
        'MONTH4'            => 'Апр',
        'MONTH5'            => 'Май',
        'MONTH6'            => 'Июнь',
        'MONTH7'            => 'Июль',
        'MONTH8'            => 'Авг',
        'MONTH9'            => 'Сент',
        'MONTH10'           => 'Окт',
        'MONTH11'           => 'Ноя',
        'MONTH12'           => 'Дек',
    ];

