<?php
    $br = Yii::$app->request->isAjax ? "\r\n" : '<br />';

    return [
        ////////////////////////////////////////////////////////////////////////
        //          COUNTRIES
        'GERMANY'           => 'Германия',
        'BELGIUM'           => 'Бельгия',
        'FRANCE'            => 'Франция',
        'NETHERLANDS'       => 'Нидерланды',
        'ITALY'             => 'Италия',
        'RUSSIA'            => 'Россия',

        ////////////////////////////////////////////////////////////////////////
        //          USER  MODEL
        'STATUS_INACTIVE'   => 'Неактивен',
        'STATUS_ACTIVE'     => 'Активный',
        'STATUS_BLOCKED'    => 'Заблокирован',
        'ACCOUNT_PLAN'      => 'План',      // Basic, Бизнес, Партнер
        'ACCOUNT_BASIC'     => 'Basic',
        'ACCOUNT_BUSINESS'  => 'Бизнес',
        'ACCOUNT_PARTNER'   => 'Партнер',
        'ROLE_USER'         => 'Пользователь',
        'ROLE_ADMIN'        => 'Админ',
        
        'LABEL_ACCOUNT'     => 'Аккаунт',
        'LABEL_LEGAL_STATUS' => 'Юридический статус',
        'LABEL_ACCTYPE'     => 'Тип аккаунта',
        'LABEL_ROLE'        => 'Роль',
        'LABEL_PASS'        => 'Пароль',
        'LABEL_REPEATPASS'  => 'Повторите пароль',  
        'LABEL_STATUS'      => 'Статус',
        'LABEL_REGISTERED'  => 'Регистр.',
        'LABEL_LASTVISIT'   => 'Посл.визит',
        'LABEL_COMPANY_NAME' => 'Название фирмы',

        
        'RULE_PASS'         => 'Пароль должен состоять только из латинских букв, цифр и знака подчеркивания',
        'RULE_REPEATPASS'   => 'Пароль и его повторение не совпадают',
        

        ////////////////////////////////////////////////////////////////////////
        //          USERPROFILE  MODEL
        'LABEL_COUNTRY'     => 'Страна',
        'LABEL_ZIP'         => 'Индекс',
        'LABEL_ADDR'        => 'Адрес (Город, улица, район, дом)',
        'LABEL_MOBILEID'    => 'CustomerID:',
        'LABEL_MOBILELOGIN' => 'Логин',
        'LABEL_MOBILEPASS'  => 'Пароль',
        'LABEL_SITE'        => 'Вебсайт',

        'TEXT_BASIC'    => 'Лимит 3 предложения <br /> Контакты с покупателями <br /> Без синхронизации предложений',
        'TEXT_BUSINESS' => 'Без лимита предложений <br /> Контакты с покупателями <br /> Синхронизация предложений',
        'TEXT_PARTNER'  => 'Без лимита предложений <br /> Без контакта с покупателями <br /> Синхронизация предложений',
        'FIFTY_EURO'    => '50 euro в месяц',
        'COMISSION'     => '% комиссия',
        'BUY'           => 'Купить',
        'COUPON'        => 'Купон',
        'SEND_BID'      => 'Отправить заявку',

        ////////////////////////////////////////////////////////////////////////
        //          USERCONTACT  MODEL
        'LABEL_NAME'        => 'Имя',
        'LABEL_LANG'        => 'Язык',
        'LABEL_PHONE'       => 'Телефон',
        'LABEL_CELL'        => 'Мобильный',


        ////////////////////////////////////////////////////////////////////////
        //          VIEW  REGISTER
        'SELECT_TYPE'       => 'типы аккаунтов',
        'FREE'              => 'Бесплатно',
        'BLOCK_PRIVATE1'    => '
            Предназначен для частных лиц, которые желают продать имеющиеся 
            личные транспортные средства или запчасти.
        ',
        'BLOCK_PRIVATE2'    => '
            <div class="line">лимит до 3 предложений</div>
            <div class="line">прямые контакты с покупателями</div>
            <div class="line">без синхронизации предложений</div>
        ',
        'BLOCK_BUSINESS1'   => '
            Предназначен для юридических лиц в качестве инструмента для 
            эффективных продаж транспортных средств и запчастей
        ',    
        'BLOCK_BUSINESS2'   => '
            <div class="line">без лимита предложений </div>
            <div class="line">прямые контакты с покупателями</div>
            <div class="line">с синхронизацией предложений</div>
        ',  
        'BLOCK_PARTNER1'    => '
            Предназначен для юридических лиц, которые являются производителями 
            техники или ретейлами запасных частей
        ',
        'BLOCK_PARTNER2'    => '
            <div class="line">без лимита предложений </div>
            <div class="line">прямые контакты с покупателями</div>
            <div class="line">с синхронизацией предложений</div>
        ',
        'REGISTER_PERMONTH' => 'в месяц',
        'REGISTER_DISCOUNT' => 'от продаж по договоренности',
        'REGISTER_BUTTON'   => 'Зарегистрировать',
        
        'REGISTER_EMAIL'    => '
            На указанный вами email будет отправлено письмо со ссылкой на форму 
            регистрации, после заполнения которой на вашу почту придет уже 
            заполненный наш типовой договор оферта.
        ',
        'ACCOUNT_CREATED'   => '
            Ваш аккаунт успешно создан. Проверьте указанный вами email и щелкните 
            по ссылке, которая содержится в письме.
        ',
        
        'REGISTRATIONMAIL_SUBJECT'  => '
            Подтверждение регистрации на сайте ' .Yii::$app->request->serverName
        ,
        'REGISTRATIONMAIL_BODY'  => '
            <br /> Для активации вашего аккаунта на сайте ' .Yii::$app->request->serverName
            . ' пожалуйста перейдите по ссылке <br /> '
        ,
        
        
        ////////////////////////////////////////////////////////////////////////
        'ACCOUNT_SAVED'     => 'Ваш аккаунт успешно сохранен',
        
        
        
        ////////////////////////////////////////////////////////////////////////
        //  VIEW  PROFILE (account_basic, account_business, account_partner)
        'CONTACT'               => 'Контакт',
        'CONNECTION'            => 'Связь',
        'LINK'                  => 'Ссылка',
        'ETC'                   => 'и т.д.',
        'UNTIL'                 => 'ДО',
        'PAYMENT'               => 'Оплата',

        'LEGAL_STATUS_PERSON'   => 'Частное лицо',
        'LEGAL_STATUS_FIRM'     => 'Фирма',

        'NOT_PAYED'             => 'Не оплачен',
        'DO_PAY'                => 'Оплатить',
        'ADD_CONTACT'           => 'Добавить контакт',
        'DELETE_CONTACT'        => 'Удалить контакт',
        'DELETE_CONFIRM'        => 'Вы уверены что хотите удалить Контакт',
        
        'SCHEDULE'              => 'Доступное время',
        'SHORT_MON'             => 'Пн',
        'SHORT_TUE'             => 'Вт',
        'SHORT_WED'             => 'Ср',
        'SHORT_THU'             => 'Чт',
        'SHORT_FRI'             => 'Пт',
        'SHORT_SAT'             => 'Сб',
        'SHORT_SUN'             => 'Вс',

        'UPLOAD_MOBILEDE'       => 'Загрузить с modile.de',
        'SYNC_CONFIRM'          => 'Выполняем загрузку данных с сайта www.modile.de',
        'CURL_MOBILE_DE_ERR'    => 'Ошибка выполнения запроса к сайту www.modile.de '.$br.$br
                                    .'Возможные причины: '.$br
                                    .'Неверные Логин или Пароль для доступа к АПИ, '.$br
                                    .'Неверный Код Пользователя (CustomerID), '.$br
                                    .'Недоступен сайт www.modile.de',
        
        ////////////////////////////////////////////////////////////////////////
        //          LOGIN
        'LOGIN'                 => 'Логин',
        'REMEMBER_ME'           => 'Запомнить меня',
        'INCORRECT_DATA'        => 'Неверный EMail или пароль',
        'FORGOT_PASS'           => 'Забыли пароль?',
        'STATUS_INACTIVE_MESS'  => 'Ваш аккаунт не активирован. Проверьте ваш EMail и перейдите по указанной в письме ссылке',
        'STATUS_BLOCKED_MESS'   => 'Ваш аккаунт заблокирован администратором сайта',
        
        
        ////////////////////////////////////////////////////////////////////////
        //          FORGOT PASS    
		'INCORRECT_STATUS'		=> 'Ваш аккаунт неактивирован. Проверьте ваш Email, найдите письмо от нашего сайта и перейдите по ссылке, которая содержится в этом письме',	
        'EMAIL_NOT_FOUND'       => 'Такого EMail в базе не существует',
        'RECOVERY_SUBJECT'      => '
            Восстановление пароля на сайте ' .Yii::$app->request->serverName
        ,
        'RECOVERY_BODY'         => '
            <br /> Для восстановления вашего пароля на сайте ' .Yii::$app->request->serverName
            . ' пожалуйста перейдите по ссылке <br /> '
        ,
        'RECOVERY_OK_MESSAGE'   => 'Проверьте указанный вами EMail и щелкните 
            по ссылке, которая содержится в письме'
        ,
        'PASS_RECOVERING'       => 'Восстановление пароля',
        'PASS_CHANGED'          => 'Ваш пароль успешно изменен',

        ////////////////////////////////////////////////////////////////////////
        //          VIEW  PAYMENT
        'BLOCK_BUSINESS_DETAILS'   => '
            <p>Количество предложений не ограничено</p>
            <p>Прямые контакты с покупателями</p>
            <p>Синхронизация предложений с других сайтов</p>
        ',
        'TOTAL'                 => 'ИТОГО',
        'SELECT_PAYMENT_TYPE'   => 'Выберите способ оплаты:',
        'USING_TRANSFER'        => 'Банковским переводом',
        'USING_CREDITCARD'      => 'Банковской картой',
        'USING_PAYPAL'          => 'Системой <br /> PayPal',
    ];

